; domain
(define (domain emergency-services)
  (:requirements :strips :typing)
  (:types 
    location person drone crate content arm
  ) 

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)
    (hand-empty ?d - drone ?a - arm)
    (holding ?d - drone ?a - arm ?c - crate)
    (crate-content ?c - crate ?cnt - content)
    (has-content ?p - person ?cnt - content)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and (not (at-drone ?d ?from)) (at-drone ?d ?to))
  )

  (:action pick-up
    :parameters (?d - drone ?a - arm ?c - crate ?l - location)
    :precondition (and (at-drone ?d ?l) (at-crate ?c ?l) (hand-empty ?d ?a))
    :effect (and (not (at-crate ?c ?l)) (not (hand-empty ?d ?a)) (holding ?d ?a ?c))
  )

  (:action deliver
    :parameters (?d - drone ?a - arm ?c - crate ?p - person ?l - location ?cnt - content)
    :precondition (and (at-drone ?d ?l) (at-person ?p ?l) (holding ?d ?a ?c) (crate-content ?c ?cnt))
    :effect (and (not (holding ?d ?a ?c)) (hand-empty ?d ?a) (has-content ?p ?cnt))
  )
)

; problem
(define (problem problem_d1_r0_l30_p30_c30_g30)
  (:domain emergency-services)
  (:objects
    drone1 - drone
    depot - location
    loc1 - location
    loc2 - location
    loc3 - location
    loc4 - location
    loc5 - location
    loc6 - location
    loc7 - location
    loc8 - location
    loc9 - location
    loc10 - location
    loc11 - location
    loc12 - location
    loc13 - location
    loc14 - location
    loc15 - location
    loc16 - location
    loc17 - location
    loc18 - location
    loc19 - location
    loc20 - location
    loc21 - location
    loc22 - location
    loc23 - location
    loc24 - location
    loc25 - location
    loc26 - location
    loc27 - location
    loc28 - location
    loc29 - location
    loc30 - location
    person1 - person
    person2 - person
    person3 - person
    person4 - person
    person5 - person
    person6 - person
    person7 - person
    person8 - person
    person9 - person
    person10 - person
    person11 - person
    person12 - person
    person13 - person
    person14 - person
    person15 - person
    person16 - person
    person17 - person
    person18 - person
    person19 - person
    person20 - person
    person21 - person
    person22 - person
    person23 - person
    person24 - person
    person25 - person
    person26 - person
    person27 - person
    person28 - person
    person29 - person
    person30 - person
    crate1 - crate
    crate2 - crate
    crate3 - crate
    crate4 - crate
    crate5 - crate
    crate6 - crate
    crate7 - crate
    crate8 - crate
    crate9 - crate
    crate10 - crate
    crate11 - crate
    crate12 - crate
    crate13 - crate
    crate14 - crate
    crate15 - crate
    crate16 - crate
    crate17 - crate
    crate18 - crate
    crate19 - crate
    crate20 - crate
    crate21 - crate
    crate22 - crate
    crate23 - crate
    crate24 - crate
    crate25 - crate
    crate26 - crate
    crate27 - crate
    crate28 - crate
    crate29 - crate
    crate30 - crate
    food - content
    medicine - content
    left - arm
    right - arm
  )
  (:init
    (at-drone drone1 depot)
    (hand-empty drone1 left)
    (hand-empty drone1 right)
    (at-crate crate1 depot)
    (at-crate crate2 depot)
    (at-crate crate3 depot)
    (at-crate crate4 depot)
    (at-crate crate5 depot)
    (at-crate crate6 depot)
    (at-crate crate7 depot)
    (at-crate crate8 depot)
    (at-crate crate9 depot)
    (at-crate crate10 depot)
    (at-crate crate11 depot)
    (at-crate crate12 depot)
    (at-crate crate13 depot)
    (at-crate crate14 depot)
    (at-crate crate15 depot)
    (at-crate crate16 depot)
    (at-crate crate17 depot)
    (at-crate crate18 depot)
    (at-crate crate19 depot)
    (at-crate crate20 depot)
    (at-crate crate21 depot)
    (at-crate crate22 depot)
    (at-crate crate23 depot)
    (at-crate crate24 depot)
    (at-crate crate25 depot)
    (at-crate crate26 depot)
    (at-crate crate27 depot)
    (at-crate crate28 depot)
    (at-crate crate29 depot)
    (at-crate crate30 depot)
    (at-person person1 loc13)
    (at-person person2 loc4)
    (at-person person3 loc19)
    (at-person person4 loc13)
    (at-person person5 loc7)
    (at-person person6 loc13)
    (at-person person7 loc5)
    (at-person person8 loc19)
    (at-person person9 loc27)
    (at-person person10 loc24)
    (at-person person11 loc9)
    (at-person person12 loc6)
    (at-person person13 loc11)
    (at-person person14 loc9)
    (at-person person15 loc11)
    (at-person person16 loc8)
    (at-person person17 loc24)
    (at-person person18 loc13)
    (at-person person19 loc11)
    (at-person person20 loc2)
    (at-person person21 loc13)
    (at-person person22 loc19)
    (at-person person23 loc16)
    (at-person person24 loc5)
    (at-person person25 loc22)
    (at-person person26 loc4)
    (at-person person27 loc14)
    (at-person person28 loc8)
    (at-person person29 loc11)
    (at-person person30 loc17)
    (crate-content crate1 food)
    (crate-content crate2 medicine)
    (crate-content crate3 medicine)
    (crate-content crate4 medicine)
    (crate-content crate5 medicine)
    (crate-content crate6 medicine)
    (crate-content crate7 medicine)
    (crate-content crate8 medicine)
    (crate-content crate9 medicine)
    (crate-content crate10 medicine)
    (crate-content crate11 medicine)
    (crate-content crate12 medicine)
    (crate-content crate13 medicine)
    (crate-content crate14 medicine)
    (crate-content crate15 medicine)
    (crate-content crate16 medicine)
    (crate-content crate17 medicine)
    (crate-content crate18 medicine)
    (crate-content crate19 medicine)
    (crate-content crate20 medicine)
    (crate-content crate21 medicine)
    (crate-content crate22 medicine)
    (crate-content crate23 medicine)
    (crate-content crate24 medicine)
    (crate-content crate25 medicine)
    (crate-content crate26 medicine)
    (crate-content crate27 medicine)
    (crate-content crate28 medicine)
    (crate-content crate29 medicine)
    (crate-content crate30 medicine)
  )
  (:goal (and
    (has-content person1 medicine)
    (has-content person2 medicine)
    (has-content person3 medicine)
    (has-content person4 medicine)
    (has-content person5 medicine)
    (has-content person6 medicine)
    (has-content person7 medicine)
    (has-content person8 medicine)
    (has-content person9 medicine)
    (has-content person10 medicine)
    (has-content person11 medicine)
    (has-content person12 food)
    (has-content person12 medicine)
    (has-content person13 medicine)
    (has-content person14 medicine)
    (has-content person15 medicine)
    (has-content person16 medicine)
    (has-content person17 medicine)
    (has-content person18 medicine)
    (has-content person19 medicine)
    (has-content person20 medicine)
    (has-content person21 medicine)
    (has-content person22 medicine)
    (has-content person23 medicine)
    (has-content person24 medicine)
    (has-content person25 medicine)
    (has-content person26 medicine)
    (has-content person27 medicine)
    (has-content person29 medicine)
    (has-content person30 medicine)
  ))
)

; plan
1. (pick-up drone1 right crate1 depot)
   deleted: (at-crate crate1 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate1)
   goals met: 0 of 30
2. (pick-up drone1 left crate2 depot)
   deleted: (at-crate crate2 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate2)
   goals met: 0 of 30
3. (fly drone1 depot loc7)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc7)
   goals met: 0 of 30
4. (fly drone1 loc7 loc6)
   deleted: (at-drone drone1 loc7)
   added: (at-drone drone1 loc6)
   goals met: 0 of 30
5. (deliver drone1 right crate1 person12 loc6 food)
   deleted: (holding drone1 right crate1)
   added: (hand-empty drone1 right) (has-content person12 food)
   goals met: 1 of 30
6. (deliver drone1 left crate2 person12 loc6 medicine)
   deleted: (holding drone1 left crate2)
   added: (hand-empty drone1 left) (has-content person12 medicine)
   goals met: 2 of 30
7. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 2 of 30
8. (pick-up drone1 right crate3 depot)
   deleted: (at-crate crate3 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate3)
   goals met: 2 of 30
9. (fly drone1 depot loc7)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc7)
   goals met: 2 of 30
10. (deliver drone1 right crate3 person5 loc7 medicine)
   deleted: (holding drone1 right crate3)
   added: (hand-empty drone1 right) (has-content person5 medicine)
   goals met: 3 of 30
11. (fly drone1 loc7 depot)
   deleted: (at-drone drone1 loc7)
   added: (at-drone drone1 depot)
   goals met: 3 of 30
12. (pick-up drone1 right crate4 depot)
   deleted: (at-crate crate4 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate4)
   goals met: 3 of 30
13. (fly drone1 depot loc27)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc27)
   goals met: 3 of 30
14. (deliver drone1 right crate4 person9 loc27 medicine)
   deleted: (holding drone1 right crate4)
   added: (hand-empty drone1 right) (has-content person9 medicine)
   goals met: 4 of 30
15. (fly drone1 loc27 depot)
   deleted: (at-drone drone1 loc27)
   added: (at-drone drone1 depot)
   goals met: 4 of 30
16. (pick-up drone1 right crate5 depot)
   deleted: (at-crate crate5 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate5)
   goals met: 4 of 30
17. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 4 of 30
18. (fly drone1 loc9 loc8)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 loc8)
   goals met: 4 of 30
19. (deliver drone1 right crate5 person16 loc8 medicine)
   deleted: (holding drone1 right crate5)
   added: (hand-empty drone1 right) (has-content person16 medicine)
   goals met: 5 of 30
20. (fly drone1 loc8 depot)
   deleted: (at-drone drone1 loc8)
   added: (at-drone drone1 depot)
   goals met: 5 of 30
21. (pick-up drone1 right crate6 depot)
   deleted: (at-crate crate6 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate6)
   goals met: 5 of 30
22. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 5 of 30
23. (fly drone1 loc9 loc2)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 loc2)
   goals met: 5 of 30
24. (deliver drone1 right crate6 person20 loc2 medicine)
   deleted: (holding drone1 right crate6)
   added: (hand-empty drone1 right) (has-content person20 medicine)
   goals met: 6 of 30
25. (fly drone1 loc2 depot)
   deleted: (at-drone drone1 loc2)
   added: (at-drone drone1 depot)
   goals met: 6 of 30
26. (pick-up drone1 right crate7 depot)
   deleted: (at-crate crate7 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate7)
   goals met: 6 of 30
27. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 6 of 30
28. (fly drone1 loc9 loc16)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 loc16)
   goals met: 6 of 30
29. (deliver drone1 right crate7 person23 loc16 medicine)
   deleted: (holding drone1 right crate7)
   added: (hand-empty drone1 right) (has-content person23 medicine)
   goals met: 7 of 30
30. (fly drone1 loc16 depot)
   deleted: (at-drone drone1 loc16)
   added: (at-drone drone1 depot)
   goals met: 7 of 30
31. (pick-up drone1 right crate8 depot)
   deleted: (at-crate crate8 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate8)
   goals met: 7 of 30
32. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 7 of 30
33. (fly drone1 loc9 loc22)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 loc22)
   goals met: 7 of 30
34. (deliver drone1 right crate8 person25 loc22 medicine)
   deleted: (holding drone1 right crate8)
   added: (hand-empty drone1 right) (has-content person25 medicine)
   goals met: 8 of 30
35. (fly drone1 loc22 depot)
   deleted: (at-drone drone1 loc22)
   added: (at-drone drone1 depot)
   goals met: 8 of 30
36. (pick-up drone1 right crate9 depot)
   deleted: (at-crate crate9 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate9)
   goals met: 8 of 30
37. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 8 of 30
38. (fly drone1 loc9 loc14)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 loc14)
   goals met: 8 of 30
39. (deliver drone1 right crate9 person27 loc14 medicine)
   deleted: (holding drone1 right crate9)
   added: (hand-empty drone1 right) (has-content person27 medicine)
   goals met: 9 of 30
40. (fly drone1 loc14 depot)
   deleted: (at-drone drone1 loc14)
   added: (at-drone drone1 depot)
   goals met: 9 of 30
41. (pick-up drone1 right crate10 depot)
   deleted: (at-crate crate10 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate10)
   goals met: 9 of 30
42. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 9 of 30
43. (fly drone1 loc9 loc17)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 loc17)
   goals met: 9 of 30
44. (deliver drone1 right crate10 person30 loc17 medicine)
   deleted: (holding drone1 right crate10)
   added: (hand-empty drone1 right) (has-content person30 medicine)
   goals met: 10 of 30
45. (fly drone1 loc17 depot)
   deleted: (at-drone drone1 loc17)
   added: (at-drone drone1 depot)
   goals met: 10 of 30
46. (pick-up drone1 right crate11 depot)
   deleted: (at-crate crate11 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate11)
   goals met: 10 of 30
47. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 10 of 30
48. (deliver drone1 right crate11 person11 loc9 medicine)
   deleted: (holding drone1 right crate11)
   added: (hand-empty drone1 right) (has-content person11 medicine)
   goals met: 11 of 30
49. (fly drone1 loc9 depot)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 depot)
   goals met: 11 of 30
50. (pick-up drone1 right crate12 depot)
   deleted: (at-crate crate12 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate12)
   goals met: 11 of 30
51. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 11 of 30
52. (deliver drone1 right crate12 person14 loc9 medicine)
   deleted: (holding drone1 right crate12)
   added: (hand-empty drone1 right) (has-content person14 medicine)
   goals met: 12 of 30
53. (fly drone1 loc9 depot)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 depot)
   goals met: 12 of 30
54. (pick-up drone1 right crate13 depot)
   deleted: (at-crate crate13 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate13)
   goals met: 12 of 30
55. (fly drone1 depot loc24)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc24)
   goals met: 12 of 30
56. (deliver drone1 right crate13 person10 loc24 medicine)
   deleted: (holding drone1 right crate13)
   added: (hand-empty drone1 right) (has-content person10 medicine)
   goals met: 13 of 30
57. (fly drone1 loc24 depot)
   deleted: (at-drone drone1 loc24)
   added: (at-drone drone1 depot)
   goals met: 13 of 30
58. (pick-up drone1 right crate14 depot)
   deleted: (at-crate crate14 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate14)
   goals met: 13 of 30
59. (fly drone1 depot loc24)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc24)
   goals met: 13 of 30
60. (deliver drone1 right crate14 person17 loc24 medicine)
   deleted: (holding drone1 right crate14)
   added: (hand-empty drone1 right) (has-content person17 medicine)
   goals met: 14 of 30
61. (fly drone1 loc24 depot)
   deleted: (at-drone drone1 loc24)
   added: (at-drone drone1 depot)
   goals met: 14 of 30
62. (pick-up drone1 right crate15 depot)
   deleted: (at-crate crate15 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate15)
   goals met: 14 of 30
63. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 14 of 30
64. (deliver drone1 right crate15 person1 loc13 medicine)
   deleted: (holding drone1 right crate15)
   added: (hand-empty drone1 right) (has-content person1 medicine)
   goals met: 15 of 30
65. (fly drone1 loc13 depot)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 depot)
   goals met: 15 of 30
66. (pick-up drone1 right crate16 depot)
   deleted: (at-crate crate16 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate16)
   goals met: 15 of 30
67. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 15 of 30
68. (deliver drone1 right crate16 person4 loc13 medicine)
   deleted: (holding drone1 right crate16)
   added: (hand-empty drone1 right) (has-content person4 medicine)
   goals met: 16 of 30
69. (fly drone1 loc13 depot)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 depot)
   goals met: 16 of 30
70. (pick-up drone1 right crate17 depot)
   deleted: (at-crate crate17 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate17)
   goals met: 16 of 30
71. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 16 of 30
72. (deliver drone1 right crate17 person6 loc13 medicine)
   deleted: (holding drone1 right crate17)
   added: (hand-empty drone1 right) (has-content person6 medicine)
   goals met: 17 of 30
73. (fly drone1 loc13 depot)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 depot)
   goals met: 17 of 30
74. (pick-up drone1 right crate18 depot)
   deleted: (at-crate crate18 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate18)
   goals met: 17 of 30
75. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 17 of 30
76. (deliver drone1 right crate18 person18 loc13 medicine)
   deleted: (holding drone1 right crate18)
   added: (hand-empty drone1 right) (has-content person18 medicine)
   goals met: 18 of 30
77. (fly drone1 loc13 depot)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 depot)
   goals met: 18 of 30
78. (pick-up drone1 right crate19 depot)
   deleted: (at-crate crate19 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate19)
   goals met: 18 of 30
79. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 18 of 30
80. (deliver drone1 right crate19 person21 loc13 medicine)
   deleted: (holding drone1 right crate19)
   added: (hand-empty drone1 right) (has-content person21 medicine)
   goals met: 19 of 30
81. (fly drone1 loc13 depot)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 depot)
   goals met: 19 of 30
82. (pick-up drone1 right crate20 depot)
   deleted: (at-crate crate20 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate20)
   goals met: 19 of 30
83. (fly drone1 depot loc19)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc19)
   goals met: 19 of 30
84. (deliver drone1 right crate20 person3 loc19 medicine)
   deleted: (holding drone1 right crate20)
   added: (hand-empty drone1 right) (has-content person3 medicine)
   goals met: 20 of 30
85. (fly drone1 loc19 depot)
   deleted: (at-drone drone1 loc19)
   added: (at-drone drone1 depot)
   goals met: 20 of 30
86. (pick-up drone1 right crate21 depot)
   deleted: (at-crate crate21 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate21)
   goals met: 20 of 30
87. (fly drone1 depot loc19)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc19)
   goals met: 20 of 30
88. (deliver drone1 right crate21 person8 loc19 medicine)
   deleted: (holding drone1 right crate21)
   added: (hand-empty drone1 right) (has-content person8 medicine)
   goals met: 21 of 30
89. (fly drone1 loc19 depot)
   deleted: (at-drone drone1 loc19)
   added: (at-drone drone1 depot)
   goals met: 21 of 30
90. (pick-up drone1 right crate22 depot)
   deleted: (at-crate crate22 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate22)
   goals met: 21 of 30
91. (fly drone1 depot loc19)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc19)
   goals met: 21 of 30
92. (deliver drone1 right crate22 person22 loc19 medicine)
   deleted: (holding drone1 right crate22)
   added: (hand-empty drone1 right) (has-content person22 medicine)
   goals met: 22 of 30
93. (fly drone1 loc19 depot)
   deleted: (at-drone drone1 loc19)
   added: (at-drone drone1 depot)
   goals met: 22 of 30
94. (pick-up drone1 right crate23 depot)
   deleted: (at-crate crate23 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate23)
   goals met: 22 of 30
95. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 22 of 30
96. (deliver drone1 right crate23 person7 loc5 medicine)
   deleted: (holding drone1 right crate23)
   added: (hand-empty drone1 right) (has-content person7 medicine)
   goals met: 23 of 30
97. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 23 of 30
98. (pick-up drone1 right crate24 depot)
   deleted: (at-crate crate24 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate24)
   goals met: 23 of 30
99. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 23 of 30
100. (deliver drone1 right crate24 person24 loc5 medicine)
   deleted: (holding drone1 right crate24)
   added: (hand-empty drone1 right) (has-content person24 medicine)
   goals met: 24 of 30
101. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 24 of 30
102. (pick-up drone1 right crate25 depot)
   deleted: (at-crate crate25 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate25)
   goals met: 24 of 30
103. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 24 of 30
104. (deliver drone1 right crate25 person2 loc4 medicine)
   deleted: (holding drone1 right crate25)
   added: (hand-empty drone1 right) (has-content person2 medicine)
   goals met: 25 of 30
105. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 25 of 30
106. (pick-up drone1 right crate26 depot)
   deleted: (at-crate crate26 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate26)
   goals met: 25 of 30
107. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 25 of 30
108. (deliver drone1 right crate26 person26 loc4 medicine)
   deleted: (holding drone1 right crate26)
   added: (hand-empty drone1 right) (has-content person26 medicine)
   goals met: 26 of 30
109. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 26 of 30
110. (pick-up drone1 right crate27 depot)
   deleted: (at-crate crate27 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate27)
   goals met: 26 of 30
111. (fly drone1 depot loc11)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc11)
   goals met: 26 of 30
112. (deliver drone1 right crate27 person13 loc11 medicine)
   deleted: (holding drone1 right crate27)
   added: (hand-empty drone1 right) (has-content person13 medicine)
   goals met: 27 of 30
113. (fly drone1 loc11 depot)
   deleted: (at-drone drone1 loc11)
   added: (at-drone drone1 depot)
   goals met: 27 of 30
114. (pick-up drone1 right crate28 depot)
   deleted: (at-crate crate28 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate28)
   goals met: 27 of 30
115. (fly drone1 depot loc11)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc11)
   goals met: 27 of 30
116. (deliver drone1 right crate28 person15 loc11 medicine)
   deleted: (holding drone1 right crate28)
   added: (hand-empty drone1 right) (has-content person15 medicine)
   goals met: 28 of 30
117. (fly drone1 loc11 depot)
   deleted: (at-drone drone1 loc11)
   added: (at-drone drone1 depot)
   goals met: 28 of 30
118. (pick-up drone1 right crate29 depot)
   deleted: (at-crate crate29 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate29)
   goals met: 28 of 30
119. (fly drone1 depot loc11)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc11)
   goals met: 28 of 30
120. (deliver drone1 right crate29 person19 loc11 medicine)
   deleted: (holding drone1 right crate29)
   added: (hand-empty drone1 right) (has-content person19 medicine)
   goals met: 29 of 30
121. (fly drone1 loc11 depot)
   deleted: (at-drone drone1 loc11)
   added: (at-drone drone1 depot)
   goals met: 29 of 30
122. (pick-up drone1 right crate30 depot)
   deleted: (at-crate crate30 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate30)
   goals met: 29 of 30
123. (fly drone1 depot loc11)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc11)
   goals met: 29 of 30
124. (deliver drone1 right crate30 person29 loc11 medicine)
   deleted: (holding drone1 right crate30)
   added: (hand-empty drone1 right) (has-content person29 medicine)
   goals met: 30 of 30
